{
    "Major": {
        "The Fool": {
            "reg": "To see the The Fool generally means a beginning of a new journey, one where you will be filled with optimism and freedom from the usual constraints in life. When we meet him, he approaches each day as an adventure, in an almost childish way. He believes that anything can happen in life and there are many opportunities that are lying out there, in the world, waiting to be explored and developed. He leads a simple life, having no worries, and does not seem troubled by the fact that he cannot tell what he will encounter ahead.",
            "rev": "you are living in the moment and not planning for the future. The reversed Fool meaning serves as caution that you should be more aware so as not to be taken advantage of. Like the dog in the Rider Waite version, this card is here to alert you on anything that may sound too good to be true."
        },"The Magician": {
            "reg": "The Magician is the representation of pure willpower. With the power of the elements and the suits, he takes the potential innate in the fool and molds it into being with the power of desire. He is the connecting force between heaven and earth, for he understands the meaning behind the words 'as above so below' - that mind and world are only reflections of one another. Remember that you are powerful, create your inner world, and the outer will follow.",
            "rev": "When you obtain the Magician reversed, it might mean its time for you to implement some changes. While right side up, the Magician represents true power, the reversed Magician is a master of illusion. The magic that he performs is one of deception and trickery. You may be lured in by the showmanship of his arts, but behind that there may be an intention to manipulate for selfish gain."
        },"The High Priestess": {
            "reg": "The meaning of the High Priestess is related with inner knowledge. Her appearance in a reading can signify that it is time for you to listen to your intuition rather than prioritizing your intellect and conscious mind. When the High Priestess shows up it can depict an archetype known as the divine feminine - the mysterious female that understands and holds the answers to the deep unknowns; religion, self, nature. She represents someone that is intuitive, and beginning to open to her or his spirituality. Meditation, prayer and new spiritual work is indicated. ",
            "rev": "When it comes to the High Priestess reversed, it can mean that you are finding it difficult to listen to your intuition. It is time for you to meditate and try new approach, for at this moment, the rational approach will not work. Something has been telling you to follow your gut, but you may be ignoring the call. There is a lot of confusion around you, and your actions may feel contrary to what you know is right. You must never be afraid to ask questions of yourself that may illuminate a new path forward for you, one that is more authentic to your inner self and your individual values."
        },"The Empress": {
            "reg": "The Empress shows us how deeply we are embedded to our femininity. Femininity could be associated with fertility, expression, creativity and nurturing among many other aspects. It therefore calls you to connect with beauty and bring happiness to your life. Understand yourself and get in touch with your sensuality so that you can attract life circumstances to bring happiness and joy. She is a signal that be kind to yourself, to take care of yourself.",
            "rev": "The Empress reversed indicates that you have lost too much of your own willpower and strength because you have started placing too much effort and concern to other peoples affairs. While the Empress's nature is of showering her loved ones with attention and care, this can sometimes go overboard. You might be neglecting your own needs, or even smothering the ones you love with your well-intentioned actions. "
        },"The Emperor": {
            "reg": "Its all about control when it comes to the Emperor, for this card means authority, regulation, organization and a fatherliness. The Emperor represents a strategic thinker who sets out plans that he must see through. He is a symbol of the masculine principle - the paternal figure in life that gives structure, creates rules and systems, and imparts knowledge. Where the Empress's desire for their kingdom is to create happiness, the emperor desires to foster honor and discipline. He guides with a firm hand, following the calling of the crown above all else. Though he is a ruler, he understands that to reign is also to serve - thus he acts rationally and according to what is for the greater good of the kingdom.",
            "rev": "The Emperor reversed is a sign of abused authoritative power. In your social life, it can manifest in the overreach of power from a father figure or a possessive partner. In career readings, it could be coming from a superior. It presents a man who wants to take control of your actions and makes you feel powerless.  It could also be that you are playing the part of a weak ruler, hatching a plan to avoid the tasks that come with having responsibility. Perhaps you aspire for a career that is more flexible than one that is governed by strict rules."
        },"The Hierophant": {
            "reg": "To see the Hierophant in a reading is to embrace the conventional, for it suggests that you have a certain desire to actually follow a process which has been well established. It also suggests that you want to stay within certain conventional bounds of what could be considered an orthodox approach. So, instead of being innovative, you will be adapting to certain beliefs and systems which are already put in place and are existing. ",
            "rev": "When you see the Hierophant in reverse, it may mean that you are feeling particularly restricted and even constrained from too many structures and rules. As a result, you have lost quite a lot of control as well as flexibility in your life. You have a particularly strong will and desire to go ahead and regain control as well as to break free from the shackles of convention. You are tempted to try unorthodox approaches or to function in a way which defies social ties and norms. "
        },"The Lovers": {
            "reg": "The primary meaning within the Lovers is harmony, attractiveness, and perfection in a relationship. The trust and the unity that the lovers have gives each of them confidence and strength, empowering the other. The bond that they have created is very strong, and it can indicate that the two are joined in marriage, and other close and intimate relationships.",
            "rev": "The Lovers reversed can point to both inner and outer conflicts that you are dealing with. The disharmony can make daily life difficult and could be putting pressure on your relationships. You should take time to think about what you are punishing yourself for, so you can fix them or let them go. At this time, you should also think about your personal values and belief system to make sure that they are aligned with what you want from your life."
        },"The Chariot": {
            "reg": "The Chariot tarot card is all about overcoming challenges and gaining victory through maintaining control of your surroundings. This perfect control and confidence allows the charioteer to emerge victorious in any situation. The use of strength and willpower are critical in ensuring that you overcome the obstacles that lie in your path. The Chariot's message comes to make you stronger as you strive to achieve your goals.",
            "rev": "The reversed Chariot's appearance in a reading can help you become aware of both your aggression, and your lack of willpower. It may either be saying that you are lacking in focus, motivation or direction, or that you are being warped by your obsession with your goals. In the former case, let the Chariot be a reminder that you can emerge victorious as long as you can gather the courage to do so. In the latter, your impulses may be another factor that you must rein in. To see the Chariot in reverse may suggest that you need to come to terms with the fact that you cannot always be in control."
        },"Strength": {
            "reg": "When you get the Strength card in an upright manner during your tarot reading, then it shows that you have inner strength and fortitude during moments of danger and distress. It shows that you have the ability to remain calm and strong even when your life is going through immense struggle. It also shows that you are a compassionate person and you always have time for other people even if it's at your own expense.",
            "rev": "An upside down Strength card can mean that you are (or about to) experience an intense anger or fear in your life. You seem to be lacking the inner strength that this card normally represents, meaning you might be experiencing fear, and a lack of conviction and confidence in your own abilities. This can mean that you have forgotten all about your passions and the kind of joy, happiness, and fulfillment that came with doing what you love. "
        },"The Hermit": {
            "reg": "The Hermit is a seeker for the knowledge that comes from within. A lonely wanderer in the path of the night, he searches for that which can only be gained with long periods of solitude - the inner voice. To hear it, he must disconnect from the crowds whose voices and desires threaten to overcome his own. He walks through the dark night of his unconscious, guided only by the low light of the northern star, with his destination being his home, his self.",
            "rev": "When reversed, you are perhaps in a situation where you'd like to be alone; there is nothing wrong about that. However, there is a possibility that your seclusion may become harmful to both yourself and others. Though the Hermit sets forwards with noble intentions to search for his inner truth, his path inward may also be filled with great danger. Going inward may lead to madness and the abyss, for the unconscious is filled with images that he may not yet understand, lurking and waiting to lure you ever inside. Like a man that gets lost in his own dreams, the hermit may find himself stuck in a world of his own, alone, trapped, unreal. You must learn to balance your need for truth with connection to your fellow human."
        },"The Wheel of Fortune": {
            "reg": "The Wheel of Fortune turns evermore, seemingly to communicate that life is made up of both good and bad times, and that the cycle is one that we cannot control. It is something that is subjected to both kings and workers, and that nobody on earth can avoid what is fated. When you have good moments in your life, make sure that you enjoy to the fullest, for what comes up must always go down. The same is true in reverse - when you are in a bad situation, things will eventually become better again. ",
            "rev": "When the wheel is reversed, it means that luck has not been on your side and misfortunes have been following you. When it's associated with this card, you must understand that these are due to external influences that you cannot control. Like the wheel, our luck and our fate is always in motion, and sometimes we are on the bottom. Be assured that the wheel will turn again, and you will be okay again soon. "
        },"Justice": {
            "reg": "Justice is about karma, and if you've been putting forth the effort, love and romance will be coming your way. If you've been kind, loving and supportive, your relationships will be a mirror of what you've been giving to others. If you've been single, your loving and positive disposition will make you especially attractive to new potential romances. ",
            "rev": "A reversed Justice tarot card could indicate various things. One Justice reversal meaning is to show you are living in denial. You are not willing to accept the consequences of your actions or others. You are running from your guilt. You must however, be aware that these are actions that are in the past. Your future depends on your actions today - and what you will do to tip the scales in balance again. How can you make up for your wrongs? Taking action gives you a chance to change and stop judging yourself. In legal matters, this could represent an unfair outcome of a case that you will not accept."
        },"The Hanged Man": {
            "reg": "The hanged man understands that his position is a sacrifice that he needed to make in order to progress forward - whether as repentance for past wrongdoings, or a calculated step backward to recalculate his path onward. This time he spends here will not be wasted, he does this as part of his progression forward. His upside down state can also symbolize the feeling of those that walk a spiritual path, for they see the world differently. Where there are others that do not understand the need to sacrifice, you see it differently. This is a natural course of action for you as you walk the path alone.",
            "rev": "The reversal meaning of the Hanged Man card represents a very specific period of time during which you feel as if you are sacrificing a significant amount of time while getting nothing in return. You might have felt as if certain things are at a state of an absolute standstill without any particular resolution or movement. It's as if you are putting your entire effort and attention into something but nothing turns out as it should."
        },"Death": {
            "reg": "Death is one of the most feared cards in a Tarot Deck, and it is very misunderstood. Many people avoid mentioning this card because it has that much power. Most times, people take the name of the card literally. However, the real meaning within the Death card is one of the most positive in the whole deck.",
            "rev": "The Death reversal meaning is still about change, but that you have been resisting it. You could be worried about letting go of the past, or you could not be sure of the changes that you need to make to go forward. Resisting the change and holding onto the past can limit your future, which can cause you to feel like you are in limbo. You should take some time to assess the ways that you have been approaching changes in your life. You may find you have been halting the changes that you need due to fears of the unknown. While you can still be afraid, you should trust that you are taking the right steps and move forward. Life moves on, so fighting passing time is only going to leave you with regrets. Death does not have to be a card of regret, especially if you heed its warning."
        },"Temperance": {
            "reg": "In moments where there is anxiety or great stress, you have been able to remain calm throughout. You are a person who has mastered the art of not letting things get to you, and this allows you to achieve much progress in all areas you seek out to explore. The Temperance tarot card suggests moderation and balance, coupled with a lot of patience. Where this card appears, there is the suggestion that extremity in any situation is to be avoided.",
            "rev": "Temperance in reversed is a reflection of something that is out of balance and may be causing stress and anxiety. The real meaning of the Temperance card can be deciphered using the other cards in the spread to identify areas where this imbalance is being caused. A Temperance in reversal may also be used as a warning;  if you take a certain path, it would lead to turbulence and excess."
        },"The Devil": {
            "reg": "Getting the devil card in your reading shows that you have feelings of entrapment, emptiness and lack of fulfillment in your life. It might also mean that you are a slave to materialism and opulence and no matter how hard you try, you just can't seem to shake off the feeling of wanting to indulge in luxurious living. ",
            "rev": "The upside down meaning of the Devil card can be the moment when an individual becomes self-aware and breaks all of the chains that come with addiction and poor habits. It might be because they are tired of running in circles and are in need of change. "
        },"The Tower": {
            "reg": "The Tower represents change in the most radical and momentous sense. It is for this reason that the card itself visually looks so unnerving. But it doesn't necessarily have to be truly frightening or ominous. Because at the heart of this card, its message is foundational, groundbreaking change.",
            "rev": "When you get the Tower card reversed, you can feel some crisis looming along the horizon, and you are struggling as much as you can to try and avoid its manifestation. What you have not realized is that these breakdowns can be beneficial in breaking down your reliance on something that is false. The tower is built on faulty foundations, and it must fall. Though the destruction will be painful, the humbleness resulting from it can bring us peace."
        },"The Star": {
            "reg": "The Star brings hope, renewed power, and strength to carry on with life. It shows how abundantly blessed you are by the universe as evidenced by the various things around you. It may not be directly evident at the moment, for this card follows the trauma of the Tower card. Remember that you hold within you all that you need for your fulfillment - the only thing that you need is courage. For this, you have all reasons to rejoice. To see this card is a message to have faith, for the universe will bless you and bring forth all that you need.",
            "rev": "When the Star card is reversed, it means that you are feeling as though everything has turned against you. The challenges that you would normally see as exciting seem instead to make you feel as though you cannot overcome them. You have lost faith in something, whether inside yourself or with something you normally find dear. "
        },"The Moon": {
            "reg": "On one hand, the Moon card can symbolize your imagination is taking the best of you. In the dark of the night, you are taking a path that you are unsure of, for there could be danger lurking in its depths. You are the crawfish embarking on the path in the card. The moon's light can bring you clarity and understanding and you should allow your intuition to guide you through this darkness. ",
            "rev": "A Moon reversal in a reading can sometimes indicate that the darker and more negative aspects of the moon are present in your life. It could represent confusion and unhappiness - you want to make progress, but you are not sure what is the right thing to do. You must deal with your anxiety and fears by overcoming them, for they are like shadows in the dark. It is time to believe in yourself and move forward."
        },"The Sun": {
            "reg": "The Sun card represents success, abundance, and radiance. Like the sun itself, it gives strength and vitality to all those that are lucky enough to feel its rays. There is much joy and happiness that is coming to you.",
            "rev": "In the reversed position, the Sun indicates that you might have significant difficulties finding positive aspects to certain situations. The clouds might be blocking out the warmth and light that you need to progress. This might be preventing you from feeling confident and powerful. You may experience certain setbacks which are damaging your optimism and enthusiasm."
        },"Judgement": {
            "reg": "The traditional Judgement meaning focuses on the moment when we reflect and evaluate ourselves and our actions. It is through self-reflection that we can have a clearer and objective understanding about where we are now, and what we need to do in order to grow as humans. The Judgement card appearing in a reading signifies that you are coming close to this significant point in your life where you must start to evaluate yourself. ",
            "rev": "The reversed Judgement card can mean that you doubt and judge yourself too harshly. This could be causing you to miss opportunities that were awaiting you. The lost momentum causes you to fall behind in your plans, which can make it difficult to move forward. This means that you should not be cautious, but you should be moving forward with pride and confidence. "
        }, "The World":{
            "reg": "To encounter the World in your cards is to encounter a great unity and wholeness. It symbolizes the moment when the inner and the outer worlds - self and other - become a single entity. In some traditions, this state is described as enlightenment, or nirvana. There is a recognition that the individual self is profoundly linked with all other things, and that we all dance and sway along the flow of life to one rhythm. Not only do you hear this rhythm, but you participate in it - following the dips and the rises, the joys and the sorrows. ",
            "rev": "You are drawing near to something that marks the end of a journey or an era. You may have many accomplishments that have lined your path, but there is a strange emptiness that fills you when you look backwards upon it, as if you have all the pieces but they are not coming together. What is missing? Do you feel connected to what you're doing? Do you feel connected to others? What alienates you from feeling complete? From feeling whole?"
        }
    },
    "Minor": {
        "Cups": { 
            "Ace": {
                "reg": "Getting the Ace of Cups upright shows that it's time to let loose of whatever emotional baggage you have and start living your life to the fullest. Like with all the other aces, there is a new beginning that is indicated here - a chance to start fresh. It might come in the form of opening yourself up to the possibilities of new relationships, romantic or otherwise, that have the ability to make you emotionally fulfilled.",
                "rev": "When the Ace of Cups is overturned, the image here is clearest - the waters pour out of the cup, it becomes empty, the gift of its waters are being wasted. Seeing the Ace of Cups upside down during your reading means you have been enduring emotional instability or pain for some time. There is a loss that is indicated here, and perhaps something that has meant much to you is no longer giving you the joy that it once had. "
            },
            "Two": {
                "reg": "To see the Two of Cups is an indication of a partnership that is built on the union of forces, a strong connection and a balanced and equal partnership. The exchange of cups suggest that each party's emotions are intertwined with the other's, and each participant's feelings have profound affects on the other. A strong pair is indicated here, the joy of two becoming one.",
                "rev": "When reversed, the Two of Cups can mean that the balance that was once there is broken. This balance was an integral part of keeping the individuals together, but to break it is to create disconnection and discord. The negative energy of two forces is present, and instead of them joining or attracting, they seem to repel each other."
            },
            "Three": {
                "reg": "The meaning behind the Three of Cups represents a period of happiness. You will be able to forget the worries of your daily life and spend quality time with family and friends.",
                "rev": "When the Three of Cups is reversed, it means that you may have no time to socialize or go out with friends. You may be too busy with school or work that you can't spare some time to have fun. The Three of Cups reversed can also mean losing touch with some of your friends. As time passes, you may find that you are growing apart from one another. When we grow older, we must put in effort to make sure that our friendships are not neglected"
            },
            "Four": {
                "reg": "The Four of Cups tend to appear when you are feeling discouraged and unmotivated. You may feel as if there is no solution or way forward in your situation. Life has become stagnant, and nothing seems to make you happy or passionate. You are feeling apathetic - regardless of what happens, whether the day is good or bad, none of it matters to you. The Four of Cups commands a self-evaluation of your attitude so that you can pull yourself out of this rut. The solution is likely right in front of you, the hand is offering you a way out, but you release yourself out of your mental stubbornness and deploy new approach.",
                "rev": "While in the upright four of cups, you may be suffering from apathy and ignore the opportunities that the universe offers you, the reversed four of cups signals the desire to have a new start"
            },
            "Five": {
                "reg": "The Five of Cups symbolizes disappointment, and the feelings that come when things go differently as you expected. You are feeling unhappy that a certain situation hasn't really turned out the way you have hoped it would. Instead of moving towards a more positive perspective, this card seems to say that you are dwelling in the past, inducing feelings of self-pity and regret. The water which is actually spilled from the cups shows that you might have missed an opportunity. It also shows that the problem is mostly emotional and not material or financial.",
                "rev": "When the card is reversed, the Five of Cups shows a significant recovery from the regret as well as proper acceptance of your past. You are beginning to realize all of the implications of your actions, and you have finally come to appreciate the lessons which can be learned from that experience. "
            },
            "Six": {
                "reg": "The Six of Cups upright generally represents generosity, naïve happiness, and childhood. It can stand for you wanting to return to a happier time, whether it was when you were a child, teenager, or young adult. Many times, these memories are things of the past, which reflect the aspects of ourselves that have vanished. You may feel that remembering these times is the only way to feel happy. The Six of Cups appearing in a reading seems to indicate that while we may look upon the past with a happy eye, we must avoid living in it.",
                "rev": "The Six of Cups reversed can mean that you are clinging to the past. You should explore your memories, but you should not allow yourself to remain there. While you may find it comforting to be in the security of home, you must also learn to forge your own path. The past should be used as a guide for the future. Learn to focus on the present, and truly be aware"
            },
            "Seven": {
                "reg": "To draw the Seven of Cups in a reading shows that you need to clearly see the shadows and visions in your imagination, not only in your dreams but also in the real world. You should be careful of wishful thinking and be alert of the choices that you make. In one sense, the Seven of Cups indicates that you are a dreamer who is both excited and afraid of the things that you see in your unconscious. In another, the Seven of Cups is a reminder that although it is good to have dreams and wishes, it is even better to take action attaining those dreams. At one point in life, you will need to stop fantasizing and face the reality of life.",
                "rev": "The Seven of Cups reversal is somewhat similar to the upright, as they both indicate dreams, illusions and temptations, but seem to emphasize the more negative qualities of this card. Your views may be inclined towards fantasy, and not grounded in reality. It may imply that you are unclear about the things that you are searching for."
            },
            "Eight": {
                "reg": "In the Eight of Cups, we are confronted with the moment of transition. We see a cloaked figure taking off to a barren land leaving behind eight golden cups. He is tired of what those cups that he has spent so much time collecting, and is now setting out to seeking a higher purpose. It may be a result of a boredom or unhappiness that comes with realizing that whatever they have been looking for in life isn't as pleasurable or as satisfying as they once assumed it would be",
                "rev": "Getting the reversed Eight of Cups can show that one is in a state of confusion about which path they are supposed to take. The confusion usually arises from not knowing what is best for you and in the end, drifting in a sea of uncertainty is going to be the resulting effect."
            },
            "Nine": {
                "reg": "After a long journey, the Nine of Cups symbolizes the finding of self-satisfaction. The emotional journey of the cups is starting to come to a close after the volatile ups and downs you faced in the earlier numbers of this suit. You have struggled to find purpose and joy after loss, you have tasted the different things that life offers, and you have left comfort in order to find greater heights. Here, you have found them, and you are indulging yourself as you celebrate this new stage of your life.",
                "rev": "When the Nine of Cups is reversed, you need to think more carefully about the things that you really want in your life. The Nine of Cups reversed can signify that you are looking for a more authentic feeling of fulfillment."
            },
            "Ten": {
                "reg": "From its joyful depiction, we can assume that the Ten of Cups embody happiness, joy, contentment and emotional satisfaction in your family, relationship or companion. It represents an idyllic state of comfort, harmony, peace and love which makes you feel like you are in paradise. This is where all your dreams, wants, needs and wishes have been fulfilled, and you feel a complete sense of satisfaction. Take a moment and breathe, look around you and be thankful for all your blessings. This card signifies something that so many of us are searching for.",
                "rev": "When the Ten of Cups is reversed, the strong bonds that one forges with family and community are broken, or twisted. The Ten of Cups is truly the most 'happily ever after' card, but somehow this idealized image of domestic peace and comfort is broken, or was unrealistic all along. Instead of connections, you may find distance. Instead of coming together, you may be pulling apart."
            },
            "Page": {
                "reg": "One of the most important meanings within the Page of Cups is that you should be open to new ideas, especially ones that stem from intuitive inspiration. The card seems to state that such inspiration should be embraced, despite it being something that you may not expect. It could lead you to adventure and open many doors. If it is a calling of a creative nature, for example, one to get into music or art, there's an especially strong push from this card to go for it. ",
                "rev": "One Page of Cups reversal meaning is that you are undergoing a block in your creativity. There are things or projects that you find interesting, but you seem to do them for other reasons than for the joy of it. You may be doing them for money, for fame, or something else. A reversed Page of Cups could indicate that you should remember the joy that your projects brought you in the first place to reclaim your imaginative spirit."
            },
            "Knight": {
                "reg": "The truth is that the Knight of Cups is the most feminine amongst all the Knight cards in the tarot. It's important to note though, that this doesn't even slightly suggest that he is any less of a worthy knight. It implies that he is in proper touch with his emotions and his intuition, and that he uses them for his own well-being and during his many romance and seduction quests. He is usually quite attractive and charming to others, regardless of their gender. ",
                "rev": "Now that you are aware of the upright Knight of Cups meaning let's take a look at what the card says when it is upside down. Reversed, the Knight of Cups means that you allow your emotions to control your life a lot more than you should. You might be overly jealous, emotional or moody. In fact, this could get up to the point of actual incapacity to take action, which is most definitely to be avoided. Jumping to conclusions too fast is characteristic of a reversed Knight of Cups, and making judgements without having the necessary information is very common."
            },
            "Queen": {
                "reg": "We can understand the meaning of the Queen of Cups from taking a closer look at the woman in image. She is seen as compassionate, caring, sensitive, and nurturing. She connects with people on the emotional level, so people enjoy her honesty and fairness. The appearance of the Queen of Cups in a reading can be guiding you to find help from others. Most times, like the other queens, this is a female figure that will come into your life. ",
                "rev": "The Queen of Cups reversed means that you are not in sync with your emotions. You can also feel restricted in the expressing the way that you truly feel. Most times, bottling up your emotions can be very damaging and will lead to a boiling point in the near future. You may have high levels of stress that you are not able to cope with anymore. "
            },
            "King": {
                "reg": "The King of Cups is one of the most influential cards in the suit of Cups. He represents creativity, emotion, and the unconscious. The card shows the ability to restrain one's emotions and be fully in charge of your feelings and impulses. Therefore, the King of Cups represents a balance between the intellect and emotions. He indicates that there is a strong relationship between understanding and feeling.",
                "rev": "The King of Cups reversed signals what happens when he is at his worst: volatility, emotional manipulation and moodiness."
            }  
        },"Pentacles": {
            "Ace": {
                "reg": "Because the suit of pentacles is primarily concerned with all things material (not just financial, but also with the sensual), this reset could manifest itself as a new career, the undertaking of a new venture, or the start of putting more care into your health. Wherever this beginning takes place, the Ace of Pentacles assures that what is to come will bring great abundance and opportunity. ",
                "rev": "Though the Ace of Pentacles usually heralds an opportunity of some sort that would lead to great gains, to see it reversed can mean that this might be a poor investment, requiring much more resources than you had initially reserved - or alternatively, you might be missing your chance."
            },
            "Two": {
                "reg": "The Two of Pentacles is a card about balance - the coins are displayed in a manner that is precarious, any small change in wind or weight can tip and send them falling. For those that may have more coins to go around, they can afford to be less careful, but at this moment things may be tight. Wealth too, is a kind of energy, and it is the kind whose goings in and goings out are easiest and most tangible to see. ",
                "rev": "When the Two of Pentacles is in reversed position, it can mean that you are trying to juggle much too many things in your life. You need to take at least a short break to eliminate the stress. In case you are feeling that you can't handle everything, you need to consider your own well-being and provide yourself with a time to breathe. In your work, the Two of Pentacles reversal can be a positive omen. Avoid committing to a lot of things since it will overwhelm you."
            },
            "Three": {
                "reg": "The threes in the tarot represent the successful completion of a goal - it takes the sources of energy in the ace and the twos and adds a foundational factor, and usually involves a group of some sort. In this scenario, the upright three of pentacles meaning is that there is a successful achievement of all the requirements to pursue your business, deal, venture or any other kind of endeavor. Successful projects usually require different kinds of expertise, and at this moment, the Three of Pentacles means that all the skills required are coming together. In short, you are enjoying enjoying working together as part of a team, and also in the initial success of this bigger project.",
                "rev": "The Three of Pentacles reversal meaning indicates that there is lack of team work; it shows that people are working against each other and undermining the project along the way. There seems to be too much competition between them - each person is trying to display superiority. This result to scarcity of resources - too many people are viewing their project partners as competitors."
            },
            "Four": {
                "reg": "The Four of Pentacles card is capable of generating both negative and positive perceptions. On one hand, the card signifies that you have successfully managed to accomplish much of your goals and you have managed to attain a significant material wealth in the process. However, on the other hand, there is a significant chance that you will start valuing things only for their material worth. You have worked hard to get to the point where you are now, and it is absolutely natural for your to desire to make sure that you remain stable. But this also has a chance to turn you into an overly possessive or greedy person who wants to ensure that no one is capable of taking away your own wealth.",
                "rev": "When reversed, the Four of Pentacles veers sharply into the negative meanings of the card. Instead of being protective you become greedy, and you succumb to stinginess. You are haunted by certain fears of poverty which compels you to be nothing but materialistic. You are incredibly self-protective and defensive in terms of materialistic things, and you are not opening up to trust other people out of fear that they may be taking them away. "
            },
            "Five": {
                "reg": "Whenever the Five of Pentacles shows up in a reading, it suggests a time of hardship and insecurity. The meaning of this card can be deep loneliness, illness, poverty or loss. Your status might take a turn for the worse in the near future. There is a chance that you will lose something significant, whether it is financial wealth or an important item. Deterioration of your health might be already ongoing or be very sudden.",
                "rev": "Unlike the upright version, the Five of Pentacles reversal meaning can be a positive one. The snow is now on top, which represents brightness coming into your life. The stained glass now symbolizes a passageway with the Pentacles serving as the light at the end of the tunnel. The reversed Five of Pentacles means change is coming. "
            },
            "Six": {
                "reg": "The Six of Pentacles means is that you are in a position where you have a good relationship with your income. Like the main figure in the card, the amount of money that you bring in and your expenses are balanced well, and you are fortunate enough to not have any stress. You are also grateful for all that you own and can happily share your wealth with others. As you can tell from the imagery in the card, the Six of Pentacles can be about charity. You can either be the man giving away money to the needy, or a beggar gratefully receiving what you need from wealthy donor.",
                "rev": "The Six of Pentacles reversed can suggest that charity can be one-way. If you have loaned someone money, you should not be expecting your money to be paid back, or your favor to be returned in the future. You should be cautious about the people you are lending money to, especially if you are not financially stable. You could also have problems with spending and giving away more than you can really afford. "
            },
            "Seven": {
                "reg": "The meaning of the Seven of Pentacles relates to investment and effort. It follows the Six of Pentacles which refers to the end of financial or material hardship. If you have been putting in time and effort in your work, it signifies that your efforts are paying off and they are going to pay off in the future as well. ",
                "rev": "The Seven of Pentacles reversed means that your returns may be scattered for now. It could also mean that the rewards of your labor are not as significant as you thought. The advantage of this is that it shows that you know when to stop investing your time, money or energy in a particular project. You, therefore, need to reevaluate your choices, and figure out where you should put your resources. The Seven of Pentacles reversal meaning could also be applied to relationships and the effort and emotions that you have invested."
            },
            "Eight": {
                "reg": "This card indicates a time that you have to work hard and focus entirely on your tasks. This is not necessarily a negative situation, but this means that you must really strive to be the best. The task that you need to accomplish can be personal or professional. No matter what type of task it is, do not be afraid to ask for help when things get overwhelming. The Eight of Pentacles refers to the efforts that you undertake. There is a possibility that there will be a lot of things that you need to address. Hard work is essential, but you still need to find a balance.",
                "rev": "When reversed, the Eight of Pentacles signifies something similar to the upright position, but the tasks may be even more demanding. This means that you need to execute swiftly and with great care if you want to be happy and successful with this outcome. In terms of work, the Eight of Pentacles reversed refers to the importance of impressing your employer through your diligence, dedication and intelligence. Never avoid any task or responsibility in your work - or else this can damage your reputation. In love, the Eight of Pentacles may reveal that both of you may not be prepared to handle the responsibilities to make your relationship work"
            },
            "Nine": {
                "reg": "This Nine of Pentacles card indicates that the querent has reached a stage in their lives where they are confident, independent and self-sufficient. Through hard work, this person is now ready to enjoy money, leisure and material comfort. ",
                "rev": "The Nine of Pentacles reversed can be indicative of suffering from financial issues. It can perhaps indicate a false display of security and stability. There may be a desire here to keep up appearances - to have all the finer things in life even when we cannot afford to do so. Where does this stem from? "
            },
            "Ten": {
                "reg": "The Ten of Pentacles deals with permanence and satisfaction. The card shows that everything you have put your efforts into for a long time will pay off in the future. It suggests that everything will work out well in the end - for you have always kept the long term picture in view, choosing to take no shortcuts. Your legacy is sure to stand for quite a long time to come. This is a relief, for the path to get here has been filled with setbacks and challenges, making this point of the journey even sweeter.",
                "rev": "The Ten of Pentacles reversed meaning may be a warning about your future financial status. It could point to problems and hiccups later on in life, even though they may not currently be an issue. It could also show the faulty nature of an investment that you have put a lot of time and effort in. In general, this reversed card seems to signal that you are placing too many bets on your short-term success, while harming your long-term potential. Take a step back and evaluate whether your decisions right now will lead to more damage in the future."
            },
            "Page": {
                "reg": "When we meet the Page of Pentacles, we see immediately that she is one that is ambitious and focused. She is protected, nourished, provided for by the suit whose name she bears. Guided by it, she is deeply tied to the earth, nature, and all of its gifts. She cherishes the body, for it too is something which is a manifestation of her element. Her diligence, ambition and loyalty drives her to quickly make plans for the future - for it is there where her focus lies.",
                "rev": "When the Page of Pentacles card appears reversed, it may point to your lack of focus. There is a possibility that you are being distracted with lots of things. Try to borrow the talents of this page and focus your mind before moving on the next thing."
            },
            "Knight": {
                "reg": "The Knight of Pentacles is about the daily tasks and the responsibility that one has to gain through a specific project. This knight has the patience to accomplish all his given duties and is considered by others reliable and committed to his work. To see this card is an indication that there is a need to be trustworthy and reliable.",
                "rev": "When the reversed Knight of Pentacles shows up in a reading, the traits that were once positive in the upright position are now taken to the extreme. You may feel stuck in your own routine, and bored of everything that surrounds you. You may desire a change of scenery in order to avoid this tiring repetition. The Knight of Pentacles reversed could also indicate that you have totally ignored many serious aspects of your life. Financial or personal issues are often be neglected in favor of work matters when this card appears reversed."
            },
            "Queen": {
                "reg": "The Queen of Pentacles represents both a down-to-earth woman who plays many roles to ensure that she keeps her family happy. She knows how and when to show love - keeping an orderly home, cooking comforting meals and takes care of the children. But do not mistake her for being only a homebody - alongside all these motherly attributes, she can plan business ventures and execute her plans successfully. It is through her naturally talented business sense that she is surrounded by such luxury. She is quiet and does not like disclosing her financial accounts, fearing that it could bring more complexity to her life, which she desires to keep rather simple. She may have a secret bank account that nobody knows about - for she may choose to be careful, vigilant and self-sufficient.",
                "rev": "When the Queen of Pentacles becomes disconnected with the energy of her suit, she can become someone who is completely self-absorbed. Gone is the upright generosity in her suit, she can be selfish and even envious when others successes seem greater than hers. Upright, her home is usually a sanctuary for her guests, but reversed it may instead be slovenly - she loses the ability to take care of herself and her surroundings. Her focus on the material may manifest negatively, making her greedy, and yet lacking in her sense of duty and capability. How can she ground herself again, how can she re-enter the sacred relationship she naturally feels with the earth and all its living creatures?"
            },
            "King":{ 
                "reg": "When we meet the King of Pentacles, we feel immediately his regal and generous presence. He is a provider and a protector, for under his care is a flourishing and abundant kingdom where its citizens are prosperous and encouraged to grow. He is naturally responsible and reliable, and through the wisdom granted to him by his suit, he has grown all that he has acquired from practically nothing. To see him in the cards is to envision success - one that was won by earnest work.",
                "rev": "When reversed, the King of Pentacles falls from his throne. Once the king of a prosperous kingdom, it has been taken away from him, or lost. Disconnected from the energy of his suit, he may have been impatient, he may have been too indulgent, he may have gambled too far and overstretched himself, he may have sought shortcuts that led him to ruin. He may become too focused on the material, only understanding the cost of things, and never their value."
        }  
        },"Swords": {
            "Ace": {
                "reg": "As with all the aces, the Ace of Swords indicates that one is about to experience a moment of breakthrough. With its sharp blade and representing the power of the intellect, this sword has the ability to cut through deception and find truth. In layman's terms, this card represents that moment in which one can see the world from a new point of view, as a place that is filled with nothing but new possibilities. It is, therefore, the best time to work on your goals - as the aces all give green lights, and are signals of waiting opportunities and new beginnings.",
                "rev": "Getting a reversed Ace of Swords might mean that one's thoughts are confused, unsure and very chaotic. This isn't a good time for one to make any decisions since they don't have any clarity on what you should be doing, meaning that the chances of failure can be pretty high."
            },
            "Two": {
                "reg": "When we see the Two of Swords in a reading, we are encountering a stalemate. Two equal and opposing forces are joined in battle, and there seems to be no end in sight. This wasn't what you had in mind when you chanced to walk down this path, and you find yourself caught in the middle. Without something, or someone to intervene, this may continue indefinitely. We find ourselves in a situation where we must make a choice, we can side with one part of the situation, or we can side with the other. Neither seems particularly appealing, which makes the decision even more difficult. But unless we move past this stalemate, there can be no more progress.",
                "rev": "The situation we see in the reversed Two of Swords is a stalemate of a legendary kind, one where two forces are battling each other. This battle can be representative of both something internal or external, and you are forced to be in between and be the decision maker. However, because neither party seems particularly pleasing to work with, you may find yourself confused, the pressure is too much, and you are unable to make a decision."
            },
            "Three": {
                "reg": "The Three of Swords depicts the message of rejection, betrayal, hurt and discouragement. In moments like these, we are well served by the mind. If you can think logically about it and prepare for the experience, the impact of this pain may be minimized.",
                "rev": "The Three of Swords reversed indicates that have faced a recent loss, a break-up or a moment of grief. You may be still recovering from this, and your emotions have not completely calmed, making it difficult to move on. Although you may still be thinking of your past suffering, this card may be a signal that it's time to let go and look forwards towards life ahead of you, because there is much for you to enjoy."
            },
            "Four": {
                "reg": "After the time of chaos, anger and pain depicted in the Three of Swords, the Four of Swords can signal that it is time to retreat. The Four of Swords is a moment of rest. Whether this is from a choice to withdraw, or whether it is from pure exhaustion, it is not clear. We are still tender from the wounds that were inflicted, and the battle weapons still hang above us as a grim reminder of what was lost. In order to continue and re-emerge in your daily life, you must take the time now to take a breather. There is always the faint fear that something more is bound to happen again and it is advisable that you take all chances to rest.",
                "rev": "Although the Four of Swords card in a reading could mean it's time for healing, a reversed card could mean restlessness. Your heart is willing to relax, but this is not what your mind wants. You feel that you have too much that is depending on you. Following this path is not advised, as it could have affects on your health"
            },
            "Five": {
                "reg": "This card indicates that you are engaging in a conflict of some nature. It can also suggest a disagreement with others, which leads to hostility and tension. Despite the fact that you think you've won, you might still lose in the big picture, because you have annoyed or hurt those that you have argued with, and as a result, you are on the road to isolating yourself. Perhaps, at the moment, you believed that it was more important to be right rather than appreciate and understand where the other side was coming from.",
                "rev": "In the upright position, the Five of Swords is a card of tension, conflict, and disagreement. The Five of Swords reversal meaning shows you that all you want is for that particular period to be over so that you can forget and forgive. Because you are beginning to understand that winning is not everything, you will be capable of focusing your energy on something a lot more constructive and positive."
            },
            "Six": {
                "reg": "The meaning of the Six of Swords is that you are experiencing a transition of some kind, but one that is not happy and filled with regret. This transition will most likely be the result of decisions you made in the past, and now they are forcing you to leave something behind in order to move forward. Despite your sadness, you need to remember that moving on is the ideal option for your future.",
                "rev": "The Six of Swords reversed can indicate that you have been trying to move on and make the transitions you need. However, you may be experiencing challenges making these a reality. You may keep returning to the past, whether it's because there are issues that are not resolved, or you are questioning your decisions. "
            },
            "Seven": {
                "reg": "The Seven of Swords in general, is said to be about betrayal and deception. When you get this card, it may imply that you or someone else in your life is having difficulty getting away with something. There are instances when we are forced to be sneaky, hoping that we will not be discovered. When we are found out, we have to face the consequences - whether it's embarrassment, punishment, or worse. Sometimes this happens when there are instances when you had to think on your feet, and did something that was somewhat shrewd and out of character. Now there is a danger of the secret coming out.",
                "rev": "The Seven of Swords reversed can have multiple meanings depending on the context of the other cards within the reading. It can suggest firstly a need to change your approach - the tactics you've been using are not working. While upright, this card can stand for a cunning victory attained by deception and trickery, the reversal can stand for either a more extreme version of such behavior. Or instead, a kind of renewal of conscience. You or someone in your circle may be deciding to unburden themselves with their guilt, and come clean about some piece of manipulation they have been involved in. Trust has been broken, but with a confession, you may be on the road to repairing it. There is a desire here to try and do things in a different way, one that is collaborative rather than independent."
            },
            "Eight": {
                "reg": "The general meaning in the Eight of Swords is that of a feeling of being trapped and victimized. You may feel powerless because, in your mind, you feel that changing the situation might be beyond you. This feeling of helplessness that you have, the feeling that you have no agency in your life, has played a major role in making your situation worse.",
                "rev": "Getting the reversed Eight of Swords is a good sign, since it shows maturity and self-acceptance, and a recognition of one's own power and responsibility - especially after a long struggle of doubt. It means that one is capable of making conscious decisions because they are confident in who they are, and their power to affect change in both themselves and the world. It's time to free ones self from the past and proverbially clear out their closet, creating room for new things and experiences."
            },
            "Nine": {
                "reg": "The Nine of Swords is often associated with fear and anxiety, about all the things that worry you and keep you up at night. Sometimes this card can be associated with trauma - one which may be shameful for you to confide with others about, and all the psychological responses that come from experiencing that trauma.",
                "rev": "To come across the Nine of Swords reversed still signals something similar to the upright version - that you may find yourself being terrorized by nightmares, by anxiety and stress. Some trauma from your past is coming back, and you find the grief of unresolved issues overwhelming."
            },
            "Ten": {
                "reg": "The Ten of Swords indicate a major disaster of some sort. It shows that a certain force of extreme magnitude has come to hit you in your life - one that you may have not foreseen. There is a sense of betrayal that is indicated here, for the character is stabbed in the back. This seems to be a reminder that despite how much we try, we cannot control everything - there are things that are beyond our ability to change. Here, this situation is unavoidable. ",
                "rev": "When we see any version of the Ten of Swords , the feelings are powerful. Whether reversed or upright, the card signals the finality of defeat. There is no way to avoid this tragedy - it has happened over a long course of events that have been a long time coming."
            },
            "Page": {
                "reg": "Bright and alert, the Page of Swords is someone who never seems to run out of ideas. She is curious, always asking questions, and gifted with a sharp tongue and quick wit to match. Her aptitude for language also makes her an incredible communicator, and with her love of ideas, you may find her always engaged in some passionate debate.",
                "rev": "When the Page of Swords is reversed, all the negative characteristics of her come out - and she may become almost dangerous. Being gifted with a sharp and alert mind, she may be using it for deception and manipulation. The sword that she wields may be used to create pain, her natural gift for language turned to a weapon. She may lack the understanding or the maturity to understand the suffering that she causes, feeling the rush that one gets upon lashing out. On the other hand, this page may be someone of empty words or promises - who though loves talking, does not really talk about much of substance. Take care to show strength and action behind your words, for you may be damaging your reputation."
            },
            "Knight": {
                "reg": "When we are thoroughly obsessed by a certain idea and strongly wish to manifest it, we are oftentimes so blinded by the actual desire for its fulfillment that we fail to note the difficulties which we may come across, or the actions and consequences that it could bring. The Knight of Swords is a very powerful figure that is full of life as well as energy. This needs to be balanced with a proper and actual realization of compassion and responsibility.",
                "rev": "The reversed Knight of Swords suggests incredible impatience, impulsiveness alongside his bursting with energy. This Knight of Swords has a lot of energy but lacks any kind of direction, and this oftentimes results in them making rather rash decisions as well as pulling down other people with them. "
            },
            "Queen": {
                "reg": "The Queen of Swords is an archetype of an older, wiser feminine intellect. She could be thought of as the most masculine of the all the queens, and may come off as quite stern and emotionless. This card represents the importance of making judgments without relying on emotion alone. The Queen of Swords beckons you to look at all the facts before making a decision. This queen does have compassion, which is why she has her hand reaching outwards in offering, but she wants to connect to people using an understanding that is intellectual.",
                "rev": "The Queen of Swords reversed meaning is that you may be thinking too much with your heart, and you are becoming too emotionally involved with your current situation. You have to start thinking more objectively, because your emotions could lead you astray. Take the time to look at the situation using various facts and use your head to create a clearer picture of what is really going on. Only then, can you decide what your next move should be."
            },
            "King": {
                "reg": "The King of Swords appearing in a reading suggests that you should remain objective in your current situation - you must establish truth by sticking to the facts. The King of Swords and his intellectual power implies that you will need to use your intellect to make your point known and attain your goals. Besides your experience and education, you should be sharp and observant, to see deeply into problems that come your way.",
                "rev": "The King of Swords in reversed shows tyrannical, abusive and manipulative habits. It may indicate the misuse of one's mental power, drive, and authority. This is an illustration of persuasion and manipulation, so as to fulfill selfish desires. The King of Swords reversal meaning may also imply that you are showing off your level of intelligence by using big words when discussing ordinary topics. Another interpretation is that you may also be a loose cannon, especially where there are angry outbursts and impulses."
            }  
        },"Wands": {
            "Ace": {
                "reg": "Wands symbolize creativity, and the Ace of Wands is the boldest among the cards in the suit. It is not the kind of creativity that you learn from school or as a hobby. It is bravely finding your own voice, it creates a place where you can develop your own vision. In other words, it is associated with willpower, and creativity in the cosmic sense.",
                "rev": "The reversed Ace of Wands indicates trials and tribulations that you will face in the near future. You might not have any direction, which leads to being uninspired or unmotivated. At this point of your life, you might not know what you really want to do. You don't know how to get out of the slump. "
            },
            "Two": {
                "reg": "The Two of Wands is a more mature version of the ace of wands, meaning that that this tarot card is all about planning and moving forward – progression. Look at it this way; you have already set out to achieve a particular task, which means you have turned an idea into a realistic plan. Such a plan will require fulfillment and therefore you have to progress from just having the plan to actually achieving what you set out for.",
                "rev": "The Two of Wands reversed meaning suggests the need to set up long-term goals. Begin the process of setting up your goals by identifying what to you is important. Proceed by planning how you intend on achieving such goals. "
            },
            "Three": {
                "reg": "The meaning of the Three of Wands hints that you are planning or going to plan for the future with more conviction. This could mean that everything around your plans is going smoothly, as you have taken the time to plan your future, and are taking steps to turn plans into action. It hints that you are perhaps creating a stable foundation for yourself.",
                "rev": "Sometimes you can't say or do the right thing; if this is the case it might seem easier to hide your head in the sand. This would be unwise; you really need to get any issues addressed and problems sorted now. The course of true love is seldom entirely smooth and any recent relationships may struggle to get off the ground, this doesn't mean they don't have wings, just that a bit of patience is called for. Trying to force things forward will be counterproductive. Before committing to a relationship, check your partner is all you think they are."
            },
            "Four": {
                "reg": "The overall meaning of the Four of Wands is that it heralds celebration as well as a harmonious, happy and relaxed home environment. In terms of numerology, the number four symbolizes stability as well as particularly reliable foundations. These are associated with a period of happiness and balance.",
                "rev": "If the upright position of the card reflects balance, stability, and harmony, the reversal position of Four of Wands implies that there is a breakdown or complete lack of harmony in your family or in your home. It's highly likely that there is a lot of tension between the members of your family or other loved ones. If you have completed something that is important to you, you are expecting to share it with those that are closest to you, and to come home to a welcome celebration, but instead, you find a lack of support. This may leave you feeling rather uncertain when it comes to your own relationships as well as the things that you can and cannot depend on."
            },
            "Five": {
                "reg": "From the image on the card, the symbolism in the Five of Wands suggests that there is form of conflict in one's life. This may be an existing conflict or one that is brewing and may eventually blow up in one's face. It may also depict a problem in communication, for example in a situation where no one really wants to listen to the other - meaning that no agreement or understanding takes place. The five men may signify problems in a group of people who are not patient enough to listen to what anyone else is saying. They only want to be heard, and since none of the others will listen, they all argue at once.",
                "rev": "The Five of Wands reversed meaning can be that your natural method of dealing with disagreements is avoiding any kind of conflict by getting away from that place as fast as you can. Sometimes this can be regarded as a good thing, but other times, it may lead to a number of issues that are brewing up within you, for which you will have to address soon. On the other hand, it can also mean that you have worked through your troubles and that you do not have any more issues to worry about."
            },
            "Six": {
                "reg": "This particular card is all about public recognition, victory, and success. Not only have you managed to properly succeed in achieving all of your goals, but you are also being publicly acknowledged for them and the results that you've managed to attain. You may have received an award or some sort of public acclaim. ",
                "rev": "When the card is reversed, this suggests that you might find yourself doubting all of your abilities as well as your overall potential to achieve any kind of success. You might be feeling particularly negative about your entire self as if you have failed others as well as yourself. This is a symbol that means that you lack the confidence and drive that you need to achieve. You need the overall support as well as recognition of third parties in order to pick you up, to emotionally provide you with some much-needed strength."
            },
            "Seven": {
                "reg": "The Seven of Wands has a similar in meaning to the Five of Wands; both cards indicate struggles after the initial fulfillment and satisfaction of an event. The Seven of Wands however is different as it is is about the struggle that you need to go through to maintain your position, rather than to attain it. This is about the difficulties we face to continue to have success. You should be ready for the competition to you defend your title, and to prove yourself. Others are going to desire the same results that you do, so you need to stay ahead of the them.",
                "rev": "The Seven of Wands reversal meaning is that you could be feeling overwhelmed by all the responsibilities and challenges that you are facing. This can make it difficult to see the whole picture. You can also feel that you have to compete and compare yourself to other people, which leaves you feeling vulnerable and inadequate. "
            },
            "Eight": {
                "reg": "The image depicted by the Eight of Wands means that the difficulties that were brought by the Seven of Wands are finally over. It signifies a strong level of energy which states that different aspects of your life will be trailblazing. Perhaps important news will be coming on your way, and you may experience a sudden, yet steady positive growth. The Eight of Wands meaning may also pertain to your work. There is a chance that the decision that you are waiting for will come your way soon. You need to be patient and just wait for it.",
                "rev": "Just like the upward Eight of Wands, the Eight of Wands reversed meaning is generally associated with patience. There is a possibility that you are feeling frustrated about something. You might now see that what you set in motion earlier created the obstacles that you are discovering right now. It is time for you to understand that you cannot change the past. You must forgive yourself, and adapt your strategy."
            },
            "Nine": {
                "reg": "The Nine of Wands tarot card is one that symbolizes great hope even when one is faced by many problems that threaten to make them lose their balance. The Nine of Wands symbolizes one's life, which has undergone too many trials but through their determination and will, they were able to overcome them. These won battles are symbolized by the eight upright wands; however, there are still more trials that the person may face. This can be one major trial or challenge that they are supposed to face for them to reach their goals or be successful in their quest. The card is a sign of hope and encouragement that you should face your trials with courage so that you may attain success.",
                "rev": "The Nine of Wands reversed shows a person who may not be a risk taker; they may not want to make a long-term move or commitment since they are afraid that they may not be able to come out of it. They are mistrustful and hence have created a boundary between themselves and others which is turning to be their own personal prison. You may be afraid that you do not have enough resources to face some upcoming challenges, which is why you may be open to running away or avoiding it."
            },
            "Ten": {
                "reg": "This card shows that you have already completed the circle of struggle. After spending too many resources and lots of energy looking for success, you have finally overcome the obstacles. The sweat off your brow was worth it - your efforts have finally been rewarded. You may find yourself living in a world of abundance where poverty and suffering have no chance to intervene.",
                "rev": "When the Ten of Wands card is reversed, it indicates that you are truly burdened by circumstances which are not necessary in your life. Look around and see what is bothering you that will not positively impact yourself even if you rectify it. Drop them all and be a free being that can think soberly and do things accurately. Anything that does not add value in your life is not worth your time, so let it go."
            },
            "Page": {
                "reg": "When we see the Page of Wands, we see a youth with enormous excitement and curiosity for the world. He knows what to do, he has the passion to succeed, but due to his inexperience and maybe a little fear of the unknown, his ideas remain abstract. He identifies new worlds to explore, new opportunities he could take advantage of quite easily, and he is even gifted with the 'big picture' vision needed to succeed. Even with all of this, he still has the tendency to either remain dormant, or get easily distracted with one idea after the other. If he doesn't learn to control this, it might be that he squanders the opportunities to advance himself.",
                "rev": "With the Page of Wands reversed, it tends to emphasize the more negative character traits of the upright version. He tends to show up when your mind is filled with one great idea after another, and are unable to progress beyond the beginning planning stages. Perhaps you have started a project or a hobby expecting that it would grow to great levels and instead you end up nowhere. As painful as it is, it is a good way of telling you that you should venture into other meaningful projects and avoid wasting time."
            },
            "Knight": {
                "reg": "The Knight of Wands' symbolism is straightforward. When it appears, it means a great time to get away and travel. The person should feel charged up and full of life. One is also ready to get things done. He is adventurous and can find fun things to do no matter where he is. There is never a dull moment when the Knight of Wands is around. When the Knight of Wands shows up in a reading it seems to suggest that the seeker wants to complete important tasks. One wants to impress others with one's knowledge and skill. The card also shows up when the person is planning to move to another place of residence. ",
                "rev": "When you get a reversed Knight of Wands, it indicates frustrations and delays. You may feel angry and that you are not getting anywhere. A reversed Knight of Wands can translate to a loss of power. You may be trying to compensate for something that you don't have total control over - this might lead to pessimism and loss of self-esteem."
            },
            "Queen": {
                "reg": "In general, the Queen of wands in a reading meaning may depict a person of extreme focus and fiery passion. She is courageous and individualistic, though at times she may appear self-centered. They have a positive and an uplifting energy; they represent someone who is willing to be by your side and stand up for you. ",
                "rev": "Regardless of its position (upright or reversed) the Queen of Wands symbolizes fertility, and all the feelings, emotions, and aspects that it brings. It may mean that there is someone who needs your help right now. In terms of work, there is a probability that you will encounter obstacles that will hamper your progress. Do not mind these obstacles and continue doing your job as you see fit. To see this card may also be a reminder to adhere to your rational side - to balance your sometimes chaotic energy with clear though, and you will be more successful."
            },
            "King": {
                "reg": "The meaning of the upright position of the King of Wands represents pure energy. Unlike the other wands cards in the deck however, this particular one is not focused on pure creativity. Instead, this king is actually way more likely to take an idea and to decisively implement it himself. The King of Wands is a natural born leader of people, and he is also extremely capable. Once the king sets for himself a certain aim or a goal, he is going to conveniently stick to it in order to ensure that it becomes a reality.",
                "rev": "The negative aspect of the card is associated, as you may guess, with a feeling of arrogance. He can even be rather aggressive in the actual pursuit of his goals, regardless of whether he's actually conscious or not of it. He wouldn't show restraint, nor even the humbleness to know when his assistance isn't actually required."
            }  
        }
    }
}